<?php echo $this->Html->script('jquery.easing.1.3.js'); ?>
<?php echo $this->Html->script('jquery.ui.totop.js'); ?>


<script type="text/javascript">
		$(document).ready(function() {
			$().UItoTop({ easingType: 'easeOutQuart' });
		});
	</script>
<h1 id="top">Συχνές ερωτήσεις</h1>
<br>
<h2>Περιεχόμενα</h2>
<?php
    $prefix = 'faq#';
    $return = $this->Html->link('Επιστροφή', $prefix.'top');

    echo '<ul id="faq"><li>';

    echo $this->Html->link(
            'Πως μπορώ να αλλάξω τα στοιχεία και τις προτιμήσεις μου;',
            $prefix.'faq1');
    echo "</li><li>";

    echo $this->Html->link(
            'Γίνεται να μη εμφανίζομαι στις αναζητήσεις συγκατοίκων;',
            $prefix.'faq2');
    echo "</li><li>";

    echo $this->Html->link(
            'Πως μπορώ να αλλάξω τα χαρακτηριστικά του σπιτιού μου;',
            $prefix.'faq3');
    echo "</li><li>";

    echo $this->Html->link(
            'Πως μπορώ να προσθέσω εικόνες για το σπίτι μου;',
            $prefix.'faq4');
<<<<<<< HEAD
    echo "</li><li>";
=======
    echo "<br/>";
>>>>>>> df38cfdfa5dd709268ba9583499db93a13618bc5

    echo $this->Html->link(
            'Πως μπορώ να ορίσω προεπιλεγμένη εικόνα σπιτιού για να εμφανίζεται
                                                            στις αναζητήσεις;',
            $prefix.'faq6');
    echo "</li><li>";

    echo $this->Html->link(
            'Γίνεται το σπίτι μου να μην εμφανίζεται στη λίστα σπιτιών ή στις
                                                                αναζητήσεις;',
            $prefix.'faq7');
    echo "</li><li>";

    echo $this->Html->link(
            'Πως μπορώ να δω το προφίλ άλλων χρηστών;',
            $prefix.'faq8');
    echo "</li><li>";

    echo $this->Html->link(
            'Πως μπορώ να δω αναλυτικά τα χαρακτηριστικά ενός σπιτιού;',
            $prefix.'faq9');
    echo "</li><li>";

    echo $this->Html->link(
            'Τι διαφορετικό μεταξύ τους έχουν τα τρία είδη αναζητήσεων;',
            $prefix.'faq10');
    echo "</li><li>";

    echo $this->Html->link(
            'Τι κάνει το κουμπί “αποθήκευση” στις αναζητήσεις;',
            $prefix.'faq11');
    echo "</li><li>";

    echo $this->Html->link(
            'Πως μπορώ να αναζητήσω συγκατοίκους με βάση τις προτιμήσεις μου;',
            $prefix.'faq12');
    echo "</li><li>";

    echo $this->Html->link(
            'Πως μπορώ να αλλάξω τις προτιμήσεις μου για την αναζήτηση
                                                                συγκατοίκων;',
            $prefix.'faq13');
<<<<<<< HEAD
    echo "</li><li>";
=======
    echo "<br/>";
>>>>>>> df38cfdfa5dd709268ba9583499db93a13618bc5

    echo $this->Html->link(
            'Τι περιέχει το δημόσιο RSS feed;',
            $prefix.'faq14');
<<<<<<< HEAD
    echo "</li><li>";
=======
    echo "<br/>";
>>>>>>> df38cfdfa5dd709268ba9583499db93a13618bc5

    echo $this->Html->link(
            'Τι περιέχει το προσωποποιημένο RSS feed;',
            $prefix.'faq15');
<<<<<<< HEAD
    echo "</li>";
=======
    echo "<br/>";
>>>>>>> df38cfdfa5dd709268ba9583499db93a13618bc5
?>
</ul>

<h2 id="faq1">Πως μπορώ να αλλάξω τα στοιχεία και τις προτιμήσεις μου;</h2>
<p>
Από το μενού “Το προφίλ μου” πατώντας το κουμπί “Επεξεργασία” εμφανίζεται μια
φόρμα στην οποία μπορούν να γίνουν οι επιθυμητές αλλαγές.
<?php echo $return; ?>
</p>

<h2 id="faq2">Γίνεται να μη εμφανίζομαι στις αναζητήσεις συγκατοίκων;</h2>
<p>
Ναι. Ξετικάροντας το κουτάκι “Να γίνομαι ορατός ...” στην επεξεργασία του
προφίλ μου.
<?php echo $return; ?>
</p>

<h2 id="faq3">Πως μπορώ να αλλάξω τα χαρακτηριστικά του σπιτιού μου;</h2>
<p>
Από το μενού “Το σπίτι μου” πατώντας το κουμπί “Επεξεργασία” εμφανίζεται μια
φόρμα στην οποία μπορού να γίνουν οι επιθυμητές αλλαγές.
<?php echo $return; ?>
</p>

<h2 id="faq4">Πως μπορώ να προσθέσω εικόνες για το σπίτι μου;</h2>
<p>
Αφού εισαχθεί το σπίτι στο σύστημα, από το μενού “Το σπίτι μου” πατώντας το
κουμπί “Προσθήκη νέας εικόνας” εμφανίζεται μια σελίδα από την οποία μπορεί να
ανεβεί μια φωτογραφία του σπιτιού.
<?php echo $return; ?>
</p>

<h2 id="faq6">Πως μπορώ να ορίσω προεπιλεγμένη εικόνα σπιτιού για να εμφανίζεται
                                                        στις αναζητήσεις;</h2>
<p>
Εάν το σπίτι διαθέτει μόνο μία εικόνα, τότε αυτή ορίζεται ως η προεπιλεγμένη.
Εάν έχει δύο ή περισσότερες εικόνες, τότε μπορεί να ορισθεί οποιαδήποτε ως
προεπιλεγμένη τοποθετώντας τον κέρσορα του ποντικιού πάνω από την επιθυμητή
εικόνα και πατώντας τον σύνδεσμο “Προεπιλεγμένη”.
<?php echo $return; ?>
</p>

<h2 id="faq7">Γίνεται το σπίτι μου να μην εμφανίζεται στη λίστα σπιτιών ή στις
                                                            αναζητήσεις;</h2>
<p>
Ναι. Ξετικάροντας το κουτάκι “Να είναι ορατό ...” στην επεξεργασία του σπιτιού
μου.
<?php echo $return; ?>
</p>

<h2 id="faq8">Πως μπορώ να δω το προφίλ άλλων χρηστών;</h2>
<p>
Στην “Αναζήτηση συγκατοίκων” και αφού πραγματοποιήσουμε μια αναζήτηση με τα
επιθυμητά κριτήρια, μπορούμε να κάνουμε κλικ πάνω στο όνομα ενός προφίλ και
εμφανίζεται το πλήρες προφίλ του.
<?php echo $return; ?>
</p>

<h2 id="faq9">Πως μπορώ να δω αναλυτικά τα χαρακτηριστικά ενός σπιτιού;</h2>
<p>
Στην “Αναζήτηση σπιτιών” ή στην “Σύνθετη αναζήτηση” και αφού πραγματοποιήσουμε
μια αναζήτηση με τα επιθυμητά κριτήρια, μπορούμε να κάνουμε κλικ πάνω στη
διεύθυνση ενός σπιτιού και εμφανίζεται η σελίδα με τα χαρακτηριστικά του σπιτιού
αναλυτικά.
<?php echo $return; ?>
</p>

<h2 id="faq10">Τι διαφορετικό μεταξύ τους έχουν τα τρία είδη αναζητήσεων;</h2>
<p>
Η “Αναζήτηση συγκατοίκων” αναζητά συγκατοίκους που πληρούν τα επιθυμητά
κριτήρια. Η “Αναζήτηση σπιτιών” αναζητά σπίτια που πληρούν τα επιλεγμένα
κριτήρια και οι κάτοικοι των σπιτιών πληρούν τα επιλεγμένα κριτήρια συγκατοίκων.
<?php echo $return; ?>
</p>

<h2 id="faq11">Τι κάνει το κουμπί “αποθήκευση” στις αναζητήσεις;</h2>
<p>
Αποθηκεύει τα κριτήρια αναζήτησης που έχουν οριστεί για την αναζήτηση στο
προφίλ του χρήστη.
<?php echo $return; ?>
</p>

<h2 id="faq12">Πως μπορώ να αναζητήσω συγκατοίκους με βάση τις προτιμήσεις
                                                                    μου;</h2>
<p>
Στην “Αναζήτηση συγκατοίκων” και στην “Αναζήτηση σπιτιών” πατώντας το κουμπί
“φόρτωση προτιμήσεων” είναι δυνατό να πραγματοποιηθεί αναζήτηση με βάση τις
σωσμένες προτιμήσεις.
<?php echo $return; ?>
</p>

<h2 id="faq13">Πως μπορώ να αλλάξω τις προτιμήσεις μου για την αναζήτηση
                                                            συγκατοίκων;</h2>
<p>
Οι προτιμήσεις συγκατοίκων μπορούν να αλλάξουν είτε με την επεξεργασία του
προφίλ μου, είτε με την αποθήκευση κριτηρίων αναζήτησης.
<?php echo $return; ?>
</p>

<h2 id="faq14">Τι περιέχει το δημόσιο RSS feed;</h2>
<p>
Το δημόσιο RSS feed περιέχει όλα τα νέα σπίτια που εισάγονται στο σύστημα.
Το RSS αυτό μπορεί να το λάβει οποιοσδήποτε, είτε είναι εγγεγραμμένος στο
σύστημα είτε όχι. Για να λάβετε το RSS κάντε κλικ στο κουμπί του RSS στο πάνω
δεξιά μέρος της ιστοσελίδας.
<?php echo $return; ?>
</p>

<h2 id="faq15">Τι περιέχει το προσωποποιημένο RSS feed;</h2>
<p>
Το προσωποποιημένο RSS feed περιέχει τα νέα σπίτια που εισάγονται στο σύστημα
και πληρούν της προτιμήσεις του χρήστη, όπως αυτές είναι ορισμένες στο προφίλ
του. Το RSS αυτό μπορούν να το λάβουν μόνο όσοι είναι εγγεγραμμένοι στην
υπηρεσία, κάνοντας κλικ στο κουμπί RSS στο προφίλ τους.
<?php echo $return; ?>
<<<<<<< HEAD
</p>
=======
</p>
>>>>>>> df38cfdfa5dd709268ba9583499db93a13618bc5
