Το παρόν μήνυμα εστάλη ως αποτέλεσμα της εγγραφής σας ως πάροχο χώρων στέγασης στο σύστημα εύρεσης συγκατοίκων του ΤΕΙ Αθήνας.

<?php if( $pdf_success ) { ?>
Το συνημμένο αρχείο αποτελεί την αίτηση η οποία πρέπει να ελεγχθεί, υπογραφεί και υποβληθεί στην αρμόδια αρχή έγκρισης συνοδευόμενη από τα απαραίτητα αποδεικτικά έγγραφα. Η υποβολή των εγγράφων γίνεται μπορεί να πραγματοποιηθεί και μέσω τηλεομοιότυπου (fax).
<?php } else { ?>
Η εγγραφή σας ολοκληρώθηκε επιτυχώς. Η αρμόδια αρχή έγκρισης θα επικοινωνήσει μαζί σας ώστε να σας ενημερώσει σχετικά με το πώς να κινηθείτε.
<?php } ?>
